Pressure_plate/cavity/0/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2206                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    movingWall
    {
        type            zeroGradient;
    }
//////////////////////////////////////////
//
//
    bottomWall
    {
        type            zeroGradient;
    }
    leftWall
    {
	    type            fixedValue;
	    value          uniform 1;
    }
     rightWall
    {
	     type            fixedValue;
	     value          uniform 0;
    }

 //////////////////////////////////////////   
    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
